# 09. 데이터 병합하기(join)

## 1. 속성값을 추가하는 경우

In [ ]:
# pd.merge(left = 데이터프레임명1,
#          right = 데이터프레임명2,
#          left_on="데이터프레임1 조인키",
#          right_on = "데이터프레임2 조인키",
#          how="조인방법") ex) inner, left, right, outer

In [ ]:
# 조인방법
# INNER JOIN(교집합) : 자료의 공통 속성인 조인키를 정의한 후 키를 기준으로 추가 속성자료 붙임(서로 키 값이 있는 경우만 조인)
# LEFT JOIN : 기준이 되는 데이터는 무조건 살린다
# RIGHT JOIN : 붙이는 데이터는 무조건 살린다
# OUTER JOIN : 기준이 되는 데이터와 붙이는 데이터 둘 다 살린다

In [ ]:
# cf) left_on과 right_on에 명시만 해준다면 컬럼명이 달라도 조인 가능

In [1]:
import pandas as pd

In [2]:
# CSV 파일을 읽어 Data Frame 변수에 저장하기
joinSellout = pd.read_csv("../dataset/join_kopo_product_volume.csv")
joinSellout.head()

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [3]:
# CSV 파일을 읽어 Data Frame 변수에 저장하기
joinMaster = pd.read_csv("../dataset/join_region_master.csv", encoding = "ms949") 
joinMaster.head()

  REGIONID REGIONNAME
0      A01         한국
1      A02         미국
2      A03        프랑스
3      A04         독일

## INNER JOIN(교집합)

In [ ]:
# : 자료의 공통 속성인 조인키를 정의한 후 키를 기준으로 추가 속성자료 붙임(서로 키 값이 있는 경우만 조인)

In [8]:
mergeResult = pd.merge(left = joinSellout,
                       right = joinMaster,
                       left_on="REGIONID",
                       right_on = "REGIONID",
                       how="inner")
mergeResult.head()

  REGIONID PRODUCT  YEARWEEK   QTY REGIONNAME
0      A01  ST0001    201901  3000         한국
1      A01  ST0001    201902  3500         한국
2      A02  ST0002    201901  4000         미국
3      A02  ST0003    201902  7000         미국

In [9]:
mergeResult = pd.merge(left = joinSellout,
                       right = joinMaster,
                       left_on="REGIONID",
                       right_on = "REGIONID",
                       how="inner")
[["REGIONID","REGIONNAME","PRODUCT","YEARWEEK","QTY"]]
mergeResult.head()

  REGIONID PRODUCT  YEARWEEK   QTY REGIONNAME
0      A01  ST0001    201901  3000         한국
1      A01  ST0001    201902  3500         한국
2      A02  ST0002    201901  4000         미국
3      A02  ST0003    201902  7000         미국

## LEFT JOIN

In [ ]:
# : 기준이 되는 데이터는 무조건 살린다

In [21]:
testDf = pd.DataFrame( [[ "A01", "미국" ]], columns=["SALESID", "SALESNAME"])
# cf) left_on과 right_on에 명시만 해준다면 컬럼명이 달라도 조인 가능
testDf

  SALESID SALESNAME
0     A01        미국

In [22]:
mergeResult2 = pd.merge(left = joinSellout,
                       right = testDf,
                       left_on="REGIONID",
                       right_on = "SALESID",
                       how="left")

In [23]:
mergeResult2

  REGIONID PRODUCT  YEARWEEK   QTY SALESID SALESNAME
0      A01  ST0001    201901  3000     A01        미국
1      A01  ST0001    201902  3500     A01        미국
2      A02  ST0002    201901  4000     NaN       NaN
3      A02  ST0003    201902  7000     NaN       NaN

# RIGHT JOIN

In [ ]:
# : 붙이는 데이터는 무조건 살린다

In [24]:
mergeResult3 = pd.merge(left = joinSellout,
                       right = joinMaster,
                       left_on="REGIONID",
                       right_on = "REGIONID",
                       how="right")

In [25]:
mergeResult3

  REGIONID PRODUCT  YEARWEEK     QTY REGIONNAME
0      A01  ST0001  201901.0  3000.0         한국
1      A01  ST0001  201902.0  3500.0         한국
2      A02  ST0002  201901.0  4000.0         미국
3      A02  ST0003  201902.0  7000.0         미국
4      A03     NaN       NaN     NaN        프랑스
5      A04     NaN       NaN     NaN         독일

# OUTER JOIN

In [ ]:
# : 기준이 되는 데이터와 붙이는 데이터 둘 다 살린다

In [ ]:
# step.1 concat 사용해서 새로운 testDf 만들기

In [32]:
joinSellout

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [38]:
testDf = pd.DataFrame( [[ "A10", "ST0009","201903", 5000 ]], columns=["REGIONID", "PRODUCT", "YEARWEEK", "QTY"])
testDf

  REGIONID PRODUCT YEARWEEK   QTY
0      A10  ST0009   201903  5000

In [39]:
testDf2 = pd.concat( [joinSellout, testDf] , axis = 0)
testDf2

  REGIONID PRODUCT YEARWEEK   QTY
0      A01  ST0001   201901  3000
1      A01  ST0001   201902  3500
2      A02  ST0002   201901  4000
3      A02  ST0003   201902  7000
0      A10  ST0009   201903  5000

In [48]:
mergeResult4 = pd.merge(left = testDf2,
                       right = joinMaster,
                       left_on="REGIONID",
                       right_on = "REGIONID",
                       how="outer")

In [49]:
mergeResult4

  REGIONID PRODUCT YEARWEEK     QTY REGIONNAME
0      A01  ST0001   201901  3000.0         한국
1      A01  ST0001   201902  3500.0         한국
2      A02  ST0002   201901  4000.0         미국
3      A02  ST0003   201902  7000.0         미국
4      A10  ST0009   201903  5000.0        NaN
5      A03     NaN      NaN     NaN        프랑스
6      A04     NaN      NaN     NaN         독일